import pandas as pd


def get_new_file(path_file, name_out_file, index_col_raz):
    """
    Метод для преобразования таблиц
    :param path_file: путь до файла
    :param name_out_file: название выходного файла
    :param index_col_raz: индекс столбца с размерами (счёт начинается с 1)
    :return: файл с таблицей в новом виде
    """
    temp_df = pd.DataFrame()
    exsel_table = pd.read_excel(path_file) # получение исходного файла
    headers = ['name', 'razmer', 'price'] # заголовки выходного файла
    data = {header:list() for header in headers}
    razmer = exsel_table.columns[index_col_raz-1] # название столбца с размерами
    columns_names = exsel_table.columns # название столбцов старой таблицы
    for i in range(0, len(columns_names)): # обход циклом названия столбцов
        name = columns_names[i]
        if name == razmer:
            continue
        df_new = exsel_table[[razmer, name]]
        for i, row in df_new.iterrows(): # обход циклом строк каждого столбца и заполнения новой таблицы
            data['name'].append(name)
            data['razmer'].append(row[razmer])
            data['price'].append(row[name])
    out_df = pd.DataFrame(data) # создание таблицы
    #print(out_df)
    temp_df = temp_df.append(out_df, ignore_index=True)  # Вписываем данные из файлов в одну таблицу
    #print(temp_df)
    # Заменяем имя на id
    out_df_name=temp_df.replace({'name': {"Аквамарин": 9205, "Алтай": 9241, "Альба": 9223, "Альба СТ": 9317,
                                            "Аметист": 24, "Амстердам": 9269, "Анастасия": 32, "Анастасия СТ": 9302,
                                            "Андерсон": 9237, "Андерсон СТ": 9331, "Ария": 3, "Атлас": 9211, "Балу": 17,
                                            "Беатрис": 9217, "Беатрис СТ": 9311, "Белла": 35, "Белла СТ": 9305,
                                            "Берилл": 25, "Берлин": 9267, "Бирюза": 9207, "Блэкберн": 9256, "Блюз": 5,
                                            "Бостон": 83, "Бэмби": 13, "Валентина": 23, "Валерия": 21, "Ванесса": 73,
                                            "Василиса": 70, "Ватсон": 9266, "Вена": 9271, "Венера": 72, "Венеция": 80,
                                            "Вероника": 68, "Версаль": 78, "Веста": 9279, "Виктория": 39,
                                            "Винсон": 9234, "Винсон СТ": 9328, "Виолетта": 71, "Витэлия": 69,
                                            "Влада": 74, "Вэлсон": 9215, "Галерас": 9250, "Гарфильд": 20, "Гелия": 33,
                                            "Гелия СТ": 9303, "Гиацинт": 27, "Гибсон": 9264, "Гранат": 26,
                                            "Грация": 9218, "Грация СТ": 9312, "Гудсон": 9216, "Дамбо": 18, "Дарья": 36,
                                            "Дарья СТ": 9306, "Джая": 9233, "Джая СТ": 9327, "Джерри": 19,
                                            "Дублин": 9268, "Дюймовочка": 9204, "Ева": 31, "Ева СТ": 9301, "Жанна": 34,
                                            "Жанна СТ": 9304, "Жозефина": 9225, "Жозефина СТ": 9319, "Злата": 38,
                                            "Злата СТ": 9307, "Иджен": 9254, "Инна": 40, "Инна СТ": 9308, "Кадар": 9251,
                                            "Казбек": 9244, "Карина": 66, "Карина СТ": 9309, "Кварц": 9206,
                                            "Кинли": 9213, "Коралл": 28, "Лавадеро": 9248, "Лазурит": 29,
                                            "Лайтсон": 9214, "Ларсон": 9236, "Ларсон СТ": 9330, "Лацио": 81,
                                            "Лилия": 9219, "Лилия СТ": 9313, "Логан": 9245, "Лолита": 9224,
                                            "Лолита СТ": 9318, "Лондон": 9276, "Людмила": 67, "Людмила СТ": 9310,
                                            "Мадрид": 84, "Майон": 9257, "Малахит": 9208, "Маргарита": 9227,
                                            "Маргарита СТ": 9321, "Марс": 9260, "Маугли": 16, "Меркурий": 9262,
                                            "Мидлсон": 9238, "Мидлсон СТ": 9332, "Милан": 9270, "Минто": 9249,
                                            "Монако": 82, "Монблан": 9230, "Монблан СТ": 9324, "Непал": 9235,
                                            "Непал СТ": 9329, "Нептун": 9261, "Нимба": 9231, "Нимба СТ": 9325,
                                            "Ода": 9334, "Олимп": 9229, "Олимп СТ": 9323, "Оникс": 9209,
                                            "Пальмира": 9220, "Пальмира СТ": 9314, "Памир": 9212, "Париж": 9275,
                                            "Пекин": 9272, "Пиноккио": 14, "Плутон": 9263, "Пумба": 12, "Пьеса": 6,
                                            "Рейнир": 9255, "Романс": 10, "Сандра": 9222, "Сандра СТ": 9316,
                                            "Санфорд": 9243, "Сатурн": 9258, "Сеул": 9277, "Сидней": 9278,
                                            "Сильвия": 9221, "Сильвия СТ": 9315, "Синай": 9232, "Синай СТ": 9326,
                                            "Сноудон": 9252, "Соната": 4, "София": 9273, "Стич": 11, "Сюита": 8,
                                            "Токио": 85, "Топаз": 65, "Торонто": 79, "Тродос": 9253, "Уитни": 9246,
                                            "Фантазия": 7, "Флаундер": 15, "Флоренция": 9274, "Фудзи": 9210,
                                            "Чиполлино": 9203, "Эванс": 9242, "Эверест": 9228, "Эверест СТ": 9322,
                                            "Эйгер": 9247, "Элен": 9226, "Элен СТ": 9320, "Эльбрус": 9240,
                                            "Эльбрус СТ": 9333, "Эриксон": 9265, "Этюд": 9, "Юпитер": 9259,
                                            "Янтарь": 30, "ActiveLife": 107, "Adelina": 56, "Alina": 50, "Balance": 106,
                                            "BodyFeel": 110, "Camila": 46, "Dalia": 58, "Dzhuana": 41, "Eleonora": 127,
                                            "FitoSlim": 104, "Fusion": 108, "Gloria": 49, "Isabel": 45, "Leona": 43,
                                            "Marita": 53, "Maximus": 59, "MaxiSleep": 114, "Medium": 109, "Novia": 54,
                                            "Olivia": 48, "Ophelia": 55, "OptimaMix": 112, "Rafaela": 44, "Relax": 113,
                                            "Serena": 47, "Sofia       ": 57, "Sofia": 57, "SoftLine": 105,
                                            "Strong": 103, "Элегия" : 1397,
                                            "TonusDream": 111, "UltraFlex": 101, "Valensia": 51, "Yulia": 52}})
    # Заменяем размер на id размеров
    out_df_razmer = out_df_name.replace({'razmer': {"60*120": 147, "65*125": 148, "70*140": 149, "70*160": 150,
                                                    "80*160": 151, "70х186": 24443, "70х190": 24444, "70х195": 24445,
                                                    "70х200": 152, "80х186": 95, "80х190": 96, "80х195": 97,
                                                    " 80х200": 98, "90х186": 99, "90х190": 100, "90х195": 101,
                                                    " 90х200": 102, "100х186": 103, "100х190": 104, "100х195": 105,
                                                    "100х200": 106, "110х186": 107, "110х190": 108, "110х195": 109,
                                                    "110х200": 110, "120х186": 111, "120х190": 112, "120х195": 113,
                                                    " 120х200": 114, "130х186": 115, "130х190": 116, "130х195": 117,
                                                    "130х200": 118, "140х186": 119, "140х190": 120, "140х195": 121,
                                                    " 140х200": 122, "150х186": 123, "150х190": 124, "150х195": 125,
                                                    "150х200": 126, "160х186": 127, "160х190": 128, "160х195": 129,
                                                    " 160х200": 130, "170х186": 131, "170х190": 132, "170х195": 133,
                                                    "170х200": 134, "180х186": 135, "180х190": 136, "180х195": 137,
                                                    " 180х200": 138, "190х186": 139, "190х190": 140, "190х195": 141,
                                                    "190х200": 142, " 200х186": 143, "200х186": 143, " 200х190": 144, "200х190": 144, " 200х195": 145, "200х195": 145,
                                                    " 200х200": 146, "80*186": 95, "80*190": 96, "80*195": 97,
                                                    " 80х200": 98, "90*186": 99, "90*190": 100, "90*195": 101}})

    out_df_itog = out_df_razmer.astype(int) # Округляем до цеылых чисел
    out_df_itog.to_excel(name_out_file, index=None, header=headers, sheet_name='Цены размеров с ID') # сохранение в эксель
    #print(out_df_itog)
if __name__=="__main__":
    for path_in_file in ['1.xlsx','2.xlsx', '3.xlsx','4.xlsx','5.xlsx', '6.xlsx','7.xlsx','8.xlsx', '9.xlsx','10.xlsx','11.xlsx', '12.xlsx']:
        path_in_new_file = path_in_file.replace('.xlsx', '')
        get_new_file(path_in_file, path_in_new_file + '_NEW.xlsx', 1)
